app/controllers/admin/admin_controller.rb

INSERT INTO `admin_admin_users` (`created_at`, `email`, `first_name`, `last_name`, `password`, `password_hash`, `password_salt`, `updated_at`) VALUES ('2015-11-13 17:40:34', 'epsadmin@admin.com', 'Jogen', 'Maltesen', 'Admin123#', '$2a$10$FdqOHOUvjX3./5BFBqhy8.KGQ6TgYRUXbAMYcKosRFfohDOi5UxTa', '$2a$10$FdqOHOUvjX3./5BFBqhy8.', '2015-11-13 17:40:34')
---
	def create
		@new_admin = Admin::AdminUser.create!({
          :email=>'epsadmin@admin.com',
          :password=>'Admin123#',
          :first_name=>'Jogen',
          :last_name=>'Maltesen',
        });