app/controllers/admin/staff_plans_controller.rb

	def index
		@plans = Admin::StaffPlans.all
---
SELECT `admin_staff_plans`.* FROM `admin_staff_plans`

	def create

		@check_plan = Admin::StaffPlans.where(:plan_name => plan_params[:plan_name]).where(:no_of_staff => plan_params[:no_of_staff]).where(:plan_price => plan_params[:plan_price])
		if @check_plan.empty?
			@StaffPlans = Admin::StaffPlans.new(plan_params)
			if @StaffPlans.save
---
SELECT COUNT(*) FROM `admin_staff_plans` WHERE `admin_staff_plans`.`plan_name` = 'test Staff plan' AND `admin_staff_plans`.`no_of_staff` = 10 AND `admin_staff_plans`.`plan_price` = 200
INSERT INTO `admin_staff_plans` (`created_at`, `no_of_staff`, `plan_name`, `plan_price`, `updated_at`) VALUES ('2015-11-24 20:26:47', 10, 'test Staff plan', 200, '2015-11-24 20:26:47')

	def edit
		@staff_plan = Admin::StaffPlans.find(params[:id])
---
SELECT `admin_staff_plans`.* FROM `admin_staff_plans` WHERE `admin_staff_plans`.`id` = 1 LIMIT 1

	def update
		Admin::StaffPlans.where(:id => params[:id]).update_all(plan_name: params[:plan_name], no_of_staff: params[:no_of_staff], plan_price: params[:plan_price])
---
UPDATE `admin_staff_plans` SET `admin_staff_plans`.`plan_name` = 'test Staff plan1', `admin_staff_plans`.`no_of_staff` = 10, `admin_staff_plans`.`plan_price` = 200 WHERE `admin_staff_plans`.`id` = 1

	def destroy
	    Admin::StaffPlans.find(params[:id]).destroy
---
DELETE FROM `admin_staff_plans` WHERE `admin_staff_plans`.`id` = 2
SELECT `admin_staff_plans`.* FROM `admin_staff_plans` WHERE `admin_staff_plans`.`id` = 2 LIMIT 1