app/controllers/admin/subscription_plans_controller.rb

SELECT `subscription_plans`.* FROM `subscription_plans`
---
	def index
		@plans = SubscriptionPlans.all

SELECT `subscription_plans`.* FROM `subscription_plans` WHERE `subscription_plans`.`plan_name` = 'Test Plan' AND `subscription_plans`.`plan_price` = '12' AND `subscription_plans`.`plan_type` = 1
SELECT COUNT(*) FROM `subscription_plans` WHERE `subscription_plans`.`plan_name` = 'Test Plan' AND `subscription_plans`.`plan_price` = '12' AND `subscription_plans`.`plan_type` = 1
INSERT INTO `subscription_plans` (`created_at`, `plan_name`, `plan_price`, `plan_type`, `updated_at`) VALUES ('2015-11-23 19:34:59', 'Test Plan', '12', 1, '2015-11-23 19:34:59')
---
	def create

		@check_plan = SubscriptionPlans.where(:plan_name => plan_params[:plan_name]).where(:plan_price => plan_params[:plan_price]).where(:plan_type => plan_params[:plan_type])
		if @check_plan.empty?
			@subscription_plan = SubscriptionPlans.new(plan_params)
			if @subscription_plan.save

SELECT `subscription_plans`.* FROM `subscription_plans` WHERE `subscription_plans`.`id` = 3 LIMIT 1
---
	def edit
		@subscription_plan = SubscriptionPlans.find(params[:id])

UPDATE `subscription_plans` SET `subscription_plans`.`plan_name` = 'Test Plan', `subscription_plans`.`plan_price` = '12', `subscription_plans`.`plan_type` = 1 WHERE `subscription_plans`.`id` = 3
---
	def update
		SubscriptionPlans.where(:id => params[:id]).update_all(plan_name: params[:plan_name], plan_price: params[:plan_price], plan_type: params[:plan_type])