app/controllers/charges_controller.rb

SELECT `subscription_plans`.* FROM `subscription_plans` WHERE `subscription_plans`.`id` = 3 LIMIT 1
UPDATE `users` SET `users`.`plan_id` = 7 WHERE `users`.`id` = 1
---
	def create
	  @plan_id = params[:plan_id]
	  @plan_details = SubscriptionPlan.find(@plan_id)
	  if @plan_details.id != nil
	  		if @plan_details.plan_type == 1
	  			@planname = "Monthly"
	  			@pantype = Time.now + 30.days
	  		elsif @plan_details.plan_type == 2
	  			@pantype = Time.now + 15.days
	  			@planname = "Quaterly"
	  		else  @plan_details.plan_type == 3
	  			@pantype = Time.now + 365.days
	  			@planname = "Yearly"
	  		end

		  @history = UsersPaymentHistory.create({
									:plan_id =>  @plan_details.id,
									:user_id => @current_user.id,
									:purchased_on => Time.new,
									:expired_on => @pantype,
									:plan_name => @planname,
									:plan_type => 'Subscription Plan'
								})
		  @history.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
				})

				response = ppr.checkout
				User.where(:id => @current_user.id).update_all(plan_id: @plan_id)