app/controllers/companies_controller.rb

	def index
		@staff_list = CompanyStaff.all
---
SELECT `company_staffs`.* FROM `company_staffs`

	def create

		@check_company = CompanyStaff.where(:email => plan_params[:email])
		if @check_company.empty?
			@check_company = CompanyStaff.new(plan_params)
			if @check_company.save
---
SELECT COUNT(*) FROM `company_staffs` WHERE `company_staffs`.`email` = 'betasoft111@gmail.com'
INSERT INTO `company_staffs` (`availability`, `company_id`, `created_at`, `email`, `experience`, `first_name`, `is_private`, `last_name`, `qualification`, `skills`, `updated_at`) VALUES ('24', 2, '2015-11-24 22:22:14', 'betasoft111@gmail.com', '3 years', 'Ramandeep', 0, 'Singh', 'B.C.A', 'php,wordpress,ror', '2015-11-24 22:22:14')

	def edit
		@staff_data = CompanyStaff.find(params[:id])
---
SELECT `company_staffs`.* FROM `company_staffs` WHERE `company_staffs`.`id` = 1 LIMIT 1

	def update
		CompanyStaff.where(:id => params[:id]).update_all(plan_params)
---
UPDATE `company_staffs` SET `company_staffs`.`first_name` = 'Ramandeep1', `company_staffs`.`last_name` = 'Singh', `company_staffs`.`email` = 'betasoft111@gmail.com', `company_staffs`.`company_id` = 5, `company_staffs`.`skills` = 'php,wordpress,ror', `company_staffs`.`availability` = '24', `company_staffs`.`is_private` = '0', `company_staffs`.`qualification` = 'B.C.A', `company_staffs`.`experience` = '3 years' WHERE `company_staffs`.`id` = 1

	def destroy
	    CompanyStaff.find(params[:id]).destroy
---
DELETE FROM `company_staffs` WHERE `company_staffs`.`id` = 2
SELECT `company_staffs`.* FROM `company_staffs` WHERE `company_staffs`.`id` = 2 LIMIT 1