app/controllers/companies_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
	def index
		if params[:txnid] && params[:txnid] != nil && params[:orderid] && params[:orderid] != nil && params[:amount] && params[:amount] != nil
			@plan_details = SubscriptionPlan.where(:plan_price => params[:amount]) #.where(:email => plan_params[:email])
			if @plan_details && @plan_details[0]
				@plan_id = @plan_details[0].id
				User.where(:id => @current_user.id).update_all(plan_id: @plan_id)