app/controllers/users_controller.rb

	def create
	  @user = User.new(user_params)
	  if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `first_name`, `last_name`, `password_hash`, `password_salt`, `updated_at`, `user_type`) VALUES ('2015-11-13 21:41:29', 'parmarth@betasoftsystems.com', 'Parmarth', 'Chraya', '$2a$10$eodra7EOvZHkLJZLZEVvrOSF1K304xeDjg2zlWSPdtXDwGtduidUu', '$2a$10$eodra7EOvZHkLJZLZEVvrO', '2015-11-13 21:41:29', 3)

	def request_password
		@user = User.find_by_email(params[:email])
		if @user == nil || @user == ''
			redirect_to "/forgot_password", :notice => "Please enter a valid email"
		else
			@random_string = (0...50).map { ('a'..'z').to_a[rand(26)] }.join
			@url  = root_url + 'reset_password/' + @random_string
    		User.where(:id => @user.id).update_all(reset_password_token: @random_string)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'randhir@betasoftsystems.com' LIMIT 1
UPDATE `users` SET `users`.`reset_password_token` = '2015-11-10 00:08:20' WHERE `users`.`id` = 1

	def reset_password
		@user = User.where(:reset_password_token => params[:reset_password_token])
		if @user.empty?
---
SELECT `users`.* FROM `users` WHERE `users`.`reset_password_token` = 'shmpybcgefqrncblynqkmdfkxextsnlykwbxghhyuagiqjdgjm'
SELECT COUNT(*) FROM `users` WHERE `users`.`reset_password_token` = 'shmpybcgefqrncblynqkmdfkxextsnlykwbxghhyuagiqjdgjm'

	def update_password
		password_salt = BCrypt::Engine.generate_salt
        password_hash = BCrypt::Engine.hash_secret(params[:password], password_salt)
		@user = User.where(:reset_password_token => params[:reset_password_token]).update_all(password_hash: password_hash, password_salt: password_salt)
---
UPDATE `users` SET `users`.`password_hash` = '$2a$10$B8uSByQTuB9TfnlvHWR2Fu1u2STUp60znXPrVXmdzrAjRmtM3//7q', `users`.`password_salt` = '$2a$10$B8uSByQTuB9TfnlvHWR2Fu' WHERE `users`.`reset_password_token` = 'xmsdbunuhwzwnnbfbwrpddiyfnipbzwpssanuezgbboohpfrlj'

	def choose_plan
		@plans = SubscriptionPlan.all
		@paln = User.find(@current_user.id)
---
SELECT `subscription_plans`.* FROM `subscription_plans`
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

	def payment_method
		@plan_details = SubscriptionPlan.find(params[:selected_plan])
---
SELECT `subscription_plans`.* FROM `subscription_plans` WHERE `subscription_plans`.`id` = 20 LIMIT 1