app/controllers/welcome_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `subscription_plans`.* FROM `subscription_plans` WHERE `subscription_plans`.`id` = 7 LIMIT 1
---
	def index
		@current_user ||= User.find(session[:user_id]) if session[:user_id]
	    if @current_user != nil

	       	#################################
			#  	     Check current plan     #
			#################################
			if @current_user.plan_id != nil
				@plan_details = SubscriptionPlans.find(current_user.plan_id)